INSERT INTO users(email, password_hash, first_name, last_name, avatar) VALUES
  ('ivanov@example.com', '5f4dcc3b5aa765d61d8327deb882cf99', 'Иван', 'Иванов', 'avatar1.jpg'),
  ('petrov@example.com', '5f4dcc3b5aa765d61d8327deb882cf99', 'Пётр', 'Петров', 'avatar2.jpg');

INSERT INTO categories(name) VALUES
  ('Книги'),
  ('Разное'),
  ('Посуда'),
  ('Игры'),
  ('Животные'),
  ('Журналы');

ALTER TABLE offers DISABLE TRIGGER ALL;
INSERT INTO offers(title, description, type, sum, picture, user_id) VALUES
  ('Отдам в хорошие руки подшивку «Мурзилка».', 'Товар в отличном состоянии. Даю недельную гарантию. Кажется, что это хрупкая вещь. Пользовались бережно и только по большим праздникам.', 'offer', 55526, 'item12.jpg', 1),
  ('Продам коллекцию журналов «Огонёк».', 'Таких предложений больше нет! При покупке с меня бесплатная доставка в черте города. Не пытайтесь торговаться. Цену вещам я знаю. Бонусом отдам все аксессуары.', 'offer', 31465, 'item08.jpg', 1),
  ('Продам новую приставку Sony Playstation 5.', 'Даю недельную гарантию. Кажется, что это хрупкая вещь. Продаю с болью в сердце... Это настоящая находка для коллекционера!', 'offer', 81584, 'item09.jpg', 1),
  ('Куплю породистого кота.', 'Две страницы заляпаны свежим кофе. Бонусом отдам все аксессуары. Если найдёте дешевле — сброшу цену. Если товар не понравится — верну всё до последней копейки.', 'offer', 51709, 'item15.jpg', 1);

ALTER TABLE offers ENABLE TRIGGER ALL;
ALTER TABLE offer_categories DISABLE TRIGGER ALL;
INSERT INTO offer_categories(offer_id, category_id) VALUES
  (1, 6),
  (2, 6),
  (3, 5),
  (4, 1);

ALTER TABLE offer_categories ENABLE TRIGGER ALL;
ALTER TABLE comments DISABLE TRIGGER ALL;
INSERT INTO COMMENTS(text, user_id, offer_id) VALUES
  ('Продаю в связи с переездом. Отрываю от сердца.', 1, 1),
  ('Совсем немного... Неплохо, но дорого Продаю в связи с переездом. Отрываю от сердца.', 2, 1),
  ('Неплохо, но дорого Оплата наличными или перевод на карту? Вы что?! В магазине дешевле.', 1, 1),
  ('Совсем немного...', 1, 2),
  ('А сколько игр в комплекте? Неплохо, но дорого', 2, 2),
  ('Совсем немного...', 1, 2),
  ('Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. А где блок питания?', 2, 2),
  ('А сколько игр в комплекте? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца.', 1, 3),
  ('А где блок питания?', 2, 3),
  ('А сколько игр в комплекте? Вы что?! В магазине дешевле.', 2, 4),
  ('Совсем немного... А сколько игр в комплекте? А где блок питания?', 1, 4),
  ('Почему в таком ужасном состоянии? С чем связана продажа? Почему так дешёво? Вы что?! В магазине дешевле.', 2, 4),
  ('А где блок питания? Неплохо, но дорого А сколько игр в комплекте?', 1, 4);

ALTER TABLE comments ENABLE TRIGGER ALL;
